areiter128/DPSK3/dspic/src/driver/power_controllers/drv_power_controllers.c
//=======================================================================================================
// Copyright(c) 2018 Microchip Technology Inc. and its subsidiaries.
// Subject to your compliance with these terms, you may use Microchip software and any derivatives
// exclusively with Microchip products. It is your responsibility to comply with third party license
// terms applicable to your use of third-party software (including open source software) that may
// accompany Microchip software.
// THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
// APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
// FITNESS FOR A PARTICULAR PURPOSE.
// IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
// LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
// MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
// ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
// EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
//=======================================================================================================

//=======================================================================================================
// @file drv_power_controllers.c
//
// @brief instances of the various power controllers that are needed in the project
//
// @ntoe    in this application we have two power converters
//          1. Buck converter
//          2. Boost converter
//          all the instances of the data structures for that converters are placed in this file
//
// @author M52409
//
// @date 2019-08-06
//=======================================================================================================

#include <stdbool.h>
#include <xc.h>

#include "driver/power_controllers/drv_power_controllers.h"
#include "driver/power_controllers/drv_power_controller_buck_generic.h"
#include "driver/power_controllers/drv_power_controller_buck_custom.h"
#include "driver/power_controllers/drv_power_controller_boost_generic.h"
#include "driver/power_controllers/drv_power_controller_boost_custom.h"

//=======================================================================================================
// local defines
//=======================================================================================================
// 
#define VIN_ADC_REFERENCE     3.3             // 3.3 Volts ==> maximum ADC-Value
#define VIN_ADC_RESOLUTION    4095UL          // 12 bits
#define VIN_FEEDBACK_GAIN     0.1253          // 1k /(1k+6.98k)

volatile uint16_t voltageInput = 0;

static inline void Drv_PowerControllerVinMeas_Task_100us(POWER_CONTROLLER_DATA_t* pPCData);

//=======================================================================================================
// @brief   wrapper function returns the Output Voltage in Volts as a double 
//=======================================================================================================
double GetVoltageBoost(void)    
{
    return Drv_PowerControllerBoost1_GetOutputVoltage();
}

//=======================================================================================================
// @brief   wrapper function returns the Input Voltage in Volts as a double 
//=======================================================================================================
double GetVoltageInput(void)     
{
    return Drv_PowerController_GetInputVoltage();
}

//=======================================================================================================
// @brief   returns the value of the DACxDATH register for the buck regulator
//=======================================================================================================
uint16_t GetDacBuck(void)
{
    return DAC1DATH;
}

//=======================================================================================================
// @brief   returns the value of the DACxDATH register for the boost regulator
//=======================================================================================================
uint16_t GetDacBoost(void)
{
    return DAC2DATH;
}

//=======================================================================================================
// @brief   returns the Input Voltage in Volts as a double
//=======================================================================================================
volatile double Drv_PowerController_GetInputVoltage()
{
    return (double)(((unsigned long)voltageInput * VIN_ADC_REFERENCE) / (VIN_FEEDBACK_GAIN * VIN_ADC_RESOLUTION));
}

void Drv_PowerControllers_Init(void)
{
    // Init all Buck Converter instances
    Drv_PowerControllerBuck1_Init(true);                       // Init Buck Converter 1
    Drv_PowerControllerBuck1_SetOutputVoltageReference_mV(BUCK1_VREF_mV); //Set Buck Converter Output to 3.3 Volt

    // Init all Boost Converter instances
    Drv_PowerControllerBoost1_Init(true);                       // Init Boost Convert 1
    Drv_PowerControllerBoost1_SetOutputVoltageReference_mV(BOOST1_VREF_mV); //Set Boost Converter Output
}

void Drv_PowerControllers_Task_100us(void)
{
    // Boost converter PWM generators are triggered by auxiliary PWM of the buck regulator,
    // therefore the boost PWM is the first to be enabled. They start running once the buck
    // PWMs get enabled.
    Drv_PowerControllerBoost_Task_100us(&pwrCtrlBoost1_Data);
    Drv_PowerControllerBuck_Task_100us(&pwrCtrlBuck1_Data);
//    Drv_PowerControllerVinMeas_Task_100us(&pwrCtrlBuck1_Data);
    
}

static inline void Drv_PowerControllerVinMeas_Task_100us(POWER_CONTROLLER_DATA_t* pPCData)
{
    // Reading input voltage
    if (_AN12RDY)
    {
        pwrCtrlBuck1_Data.voltageInput  = ADCBUF12;
        pwrCtrlBoost1_Data.voltageInput = ADCBUF12;
        _ADCAN12IF = 0;
    }
}

volatile uint16_t Drv_PowerControllers_InitPWM(void)
{
    // Make sure power to the peripheral is enabled
    PMD1bits.PWMMD = 0; // PWM Module Disable: PWM module is enabled
    
